# Decision Tree Classifier

## using Titanic data set         29 sep 2021    (wed)

In [1]:
import pandas as pd
import seaborn as sn

In [2]:
df = sn.load_dataset('titanic')
#pd.set_option('display.max_row', None)
df.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [3]:
df1 = df.drop(columns = ['class', 'sibsp', 'parch', 'embarked', 'who', 'adult_male', 'deck', 'embark_town', 'alive', 'alone'])
df1.head(2)

   survived  pclass     sex   age     fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833

In [4]:
df1.isnull().sum()/df1.shape[0]*100

survived     0.00000
pclass       0.00000
sex          0.00000
age         19.86532
fare         0.00000
dtype: float64

In [5]:
df1.head(2)

   survived  pclass     sex   age     fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833

#### Label Encoder ka use karenge    text ko number me badlenge

In [6]:
from sklearn.preprocessing import LabelEncoder
le_sex = LabelEncoder()

In [7]:
df1['sex_n'] = le_sex.fit_transform(df1['sex'])

### dd   ---> Defined

In [8]:
dd = df1.drop(columns = ['sex'])
dd

     survived  pclass   age     fare  sex_n
0           0       3  22.0   7.2500      1
1           1       1  38.0  71.2833      0
2           1       3  26.0   7.9250      0
3           1       1  35.0  53.1000      0
4           0       3  35.0   8.0500      1
..        ...     ...   ...      ...    ...
886         0       2  27.0  13.0000      1
887         1       1  19.0  30.0000      0
888         0       3   NaN  23.4500      0
889         1       1  26.0  30.0000      1
890         0       3  32.0   7.7500      1

[891 rows x 5 columns]

### ff   --   defined

In [9]:
ff = dd.dropna()
ff.isnull().sum()
ff.head(2)

   survived  pclass   age     fare  sex_n
0         0       3  22.0   7.2500      1
1         1       1  38.0  71.2833      0

In [10]:
x = ff.iloc[:, 1:]
y = ff[['survived']]

In [11]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [12]:
model.fit(x,y)

DecisionTreeClassifier()

In [13]:
model.score(x,y)

0.9845938375350141

In [14]:
model.predict([[3,4,90, 1]])

array([0], dtype=int64)

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
plt.figure(figsize = (10,8))
sn.heatmap(ff)

In [ ]:
sn.scatterplot(x = 'age', y = 'fare', data= ff, hue = 'pclass')